       IDENTIFICATION DIVISION.
           PROGRAM-ID. CBL0001.



       PROCEDURE DIVISION.
              DISPLAY "HELLO WORLD".
              STOP RUN.
              