//Z88116A JOB 1,NOTIFY=&SYSUID
//COMP EXEC IGYWCL
//COBOL.SYSIN  DD DSN=Z88116.CBL(DATAS),DISP=SHR
//LKED.SYSLMOD DD DSN=Z88116.LOAD(DATAS),DISP=SHR
//RUN EXEC PGM=DATAS
//STEPLIB DD DSN=Z88116.LOAD,DISP=SHR
//SYSOUT DD SYSOUT=*