//Z88116A  JOB 1,NOTIFY=&SYSUID
//ALLOC    EXEC PGM=IEFBR14
//CSVFILE  DD DSN=Z88116.UNEMPLOY.CSV,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(5,5)),
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=15000)