//Z88116C  JOB 1,NOTIFY=&SYSUID
//* SADECE DERLEME VE BAGLAMA YAPAR (IGYWCL)
//COMPLINK EXEC IGYWCL,PARM.COBOL='RENT,APOST,RMODE(ANY)'
//COBOL.SYSIN  DD DSN=Z88116.SOURCE(GETDATA),DISP=SHR
//LKED.SYSLMOD DD DSN=Z88116.LOAD(GETDATA),DISP=SHR