//Z88116V  JOB 1,NOTIFY=&SYSUID
//DEFVSAM  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DEFINE CLUSTER ( -
    NAME(Z88116.UNEMPLOY.KSDS) -
    INDEXED -
    KEYS(8 0) -
    RECORDSIZE(80 150) -
    TRACKS(5 5) -
    FREESPACE(10 10) -
  ) -
  DATA (NAME(Z88116.UNEMPLOY.KSDS.DATA)) -
  INDEX (NAME(Z88116.UNEMPLOY.KSDS.INDEX))
/*