//Z88116R  JOB 1,NOTIFY=&SYSUID
//CHECKCSV EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=Z88116.UNEMPLOY.CSV,DISP=SHR
//SYSUT2   DD SYSOUT=*
//SYSIN    DD DUMMY
//RUNLOAD  EXEC IGYWCLG,PARM.COBOL='TEST,RENT,APOST,RMODE(ANY)'
//COBOL.SYSIN  DD DSN=Z88116.SOURCE(LOADER),DISP=SHR
//GO.CSVFILE   DD DSN=Z88116.UNEMPLOY.CSV,DISP=SHR
//GO.VSAMFILE  DD DSN=Z88116.UNEMPLOY.KSDS,DISP=SHR
//GO.SYSOUT    DD SYSOUT=*