//TWOSUM   JOB (ACCT),'UMUT',CLASS=A,MSGCLASS=X
//STEP1    EXEC IGYWCLG
//COBOL.SYSIN DD DSN=Z88116.CBL(TWOSUM),DISP=SHR
//GO.SYSIN DD *
02
07
11
15
009
/*