       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADVANCED.



       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUMERIC-ZD-DEC-1 PIC S999 VALUE 456.

       PROCEDURE DIVISION.
           