       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOOPS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  COUNTER        PIC 9(5).
       01  COUNTER-2      PIC 9(5).
       PROCEDURE DIVISION.
           DISPLAY "BASIC LOOP"
           PERFORM BASIC-LOOP
           DISPLAY "NESTED LOOP"
           PERFORM NESTED-LOOPS.
      * BASIC LOOP



       BASIC-LOOP.
           PERFORM VARYING COUNTER FROM 01 BY 1 UNTIL COUNTER EQUAL 11
           DISPLAY COUNTER
           END-PERFORM.

       NESTED-LOOPS.
           MOVE 0 TO COUNTER
           PERFORM VARYING COUNTER FROM 01 BY 1 UNTIL COUNTER EQUAL 11
           AFTER COUNTER-2 FROM 01 BY 1 UNTIL COUNTER-2 EQUAL 11

           
           DISPLAY COUNTER-2
           END-PERFORM.
           