//RUNADV   JOB 1,NOTIFY=Z88116,MSGCLASS=X
//COBRUN   EXEC IGYWCL
//COBOL.SYSIN  DD DSN=Z88116.CBL(ADVANCED),DISP=SHR
//LKED.SYSLMOD DD DSN=Z88116.LOAD(ADVANCED),DISP=SHR
//RUN      EXEC PGM=ADVANCED
//STEPLIB  DD DSN=Z88116.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*