//Z88116J  JOB 1,NOTIFY=Z88116
//COBRUN   EXEC IGYWCLG,SRC=DYSALE
//GO.SALES    DD DSNAME=Z88116.SALES.DAT,DISP=SHR
//GO.VALIDSAL DD DSNAME=Z88116.VALID.DAT,DISP=SHR
//GO.ERRORS   DD DSNAME=Z88116.ERROR.LOG,DISP=SHR
//GO.REPOUT   DD DSNAME=Z88116.REPORT.TXT,DISP=SHR
//GO.SORTWK01 DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//GO.SORTWK02 DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))