//Z88116R  JOB 1,NOTIFY=Z88116
//*-------------------------------------------------------------------
//* DB2 BATCH COBOL CALISTIRMA JCL'I (PLAN=Z88116)
//*-------------------------------------------------------------------
//RUNCOB   EXEC PGM=IKJEFT01
//STEPLIB  DD DISP=SHR,DSN=Z88116.LOAD
//         DD DISP=SHR,DSN=DSND10.SDSNLOAD
//REPOUT   DD DSNAME=Z88116.REPORT,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSTSIN  DD *
  DSN SYSTEM(DBDG)
  RUN PROGRAM(DYSALE) PLAN(Z88116)
  END
/*