//Z88116C  JOB 1,NOTIFY=Z88116
//*-------------------------------------------------------------------
//* 1. COMPILE COBOL WITH INTEGRATED SQL COPROCESSOR (IGY650)
//*-------------------------------------------------------------------
//COB      EXEC PGM=IGYCRCTL,
//            PARM='APOST,LIB,MAP,SQL',
//            REGION=0M
//STEPLIB  DD DSN=IGY650.SIGYCOMP,DISP=SHR
//         DD DSN=CEE.SCEERUN,DISP=SHR
//         DD DSN=CEE.SCEERUN2,DISP=SHR
//         DD DSN=DSND10.DBDG.SDSNEXIT,DISP=SHR
//         DD DSN=DSND10.SDSNLOAD,DISP=SHR
//SYSIN    DD DSN=Z88116.CBL(DYSALE),DISP=SHR
//SYSLIN   DD DSN=&&OBJMOD,DISP=(NEW,PASS),
//            UNIT=SYSALLDA,SPACE=(TRK,(30,10))
//DBRMLIB  DD DSN=Z88116.DBRM(DYSALE),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT2   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT3   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT4   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT5   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT6   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT7   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT8   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT9   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT10  DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT11  DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT12  DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT13  DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT14  DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT15  DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSMDECK DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//*-------------------------------------------------------------------
//* 2. LINK-EDIT TO CREATE LOAD MODULE (Z88116.LOAD)
//*-------------------------------------------------------------------
//LKED     EXEC PGM=IEWBLINK,REGION=0M
//SYSLIB   DD DSN=CEE.SCEELKEX,DISP=SHR
//         DD DSN=CEE.SCEELKED,DISP=SHR
//         DD DSN=DSND10.DBDG.SDSNEXIT,DISP=SHR
//         DD DSN=DSND10.SDSNLOAD,DISP=SHR
//SYSLIN   DD DSN=&&OBJMOD,DISP=(OLD,DELETE)
//         DD DDNAME=SYSIN
//SYSLMOD  DD DSN=Z88116.LOAD(DYSALE),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSIN    DD *
 INCLUDE SYSLIB(DSNELI)
 ENTRY DYSALE
 NAME DYSALE(R)
/*
//*-------------------------------------------------------------------
//* 3. BIND THE DBRM DIRECTLY TO THE PRE-CREATED PLAN
//*-------------------------------------------------------------------
//BIND     EXEC PGM=IKJEFT01
//STEPLIB  DD DSN=DSND10.SDSNLOAD,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
  DSN SYSTEM(DBDG)
  BIND PLAN(Z88116) MEMBER(DYSALE) -
       LIBRARY('Z88116.DBRM') -
       ACTION(REPLACE) RETAIN
  END
/*