       IDENTIFICATION DIVISION.
        PROGRAM-ID.           MAIN.
        AUTHOR.               UMUT-YURDUGUL.
        INSTALLATION.         HOME-LABS.
        DATE-WRITTEN.         7/13/2026.
        DATE-COMPILED.         7/13/2026.



       ENVIRONMENT DIVISION.
        CONFIGURATION SECTION.
         SOURCE-COMPUTER.   EXCALIBUR.
         OBJECT-COMPUTER.    IBM-390
           PROGRAM COLLATING SEQUENCE IS SPECIAL-SEQUENCE.
         SPECIAL-NAMES.
           ALPHABET SPECIAL-SEQUENCE IS "A" THRU "Z" "0" THRU "9"
           SYMBOLIC CHARACTERS QUESTION-MARK IS 77 
           CLASS DIGITS IS "0" THRU "9".

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  IDX PIC X(1) VALUE 0. 
       01  MESAJ PIC X(20) VALUE "SOMETHING IMPORTANT.".




       PROCEDURE DIVISION.
           DISPLAY MESAJ QUESTION-MARK.
           
           STOP RUN.
