//RUNMAIN  JOB (ACCT),'UMUT',CLASS=A,MSGCLASS=X
//STEP1    EXEC IGYWCLG
//COBOL.SYSIN DD DSN=Z88116.CBL(DOCBL),DISP=SHR
//GO.INFILE DD DSN=Z88116.DOCS(DATA),DISP=SHR